In [87]:
import numpy as np
import pandas as pd

In [88]:
df = pd.read_csv('tips.csv')

In [89]:
df.head(5)

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

# Conditional Filtering

In [90]:
bill_bool = df['total_bill'] > 40
sex_bool = df['sex'] == 'Male'

#AND & -- for both conditions to be true
#OR  | -- for one condition to be true

#df[(df['total_bill'] > 40) & (df['sex'] == 'Male')]

In [91]:
print(len(bill_bool))
print(len(sex_bool))

244
244

In [92]:
bool_final = (bill_bool & sex_bool)

In [93]:
df[bool_final]

     total_bill    tip   sex  ...       Payer Name         CC Number Payment ID
59        48.27   6.73  Male  ...      Brian Ortiz  6596453823950595    Sat8139
95        40.17   4.73  Male  ...    Aaron Bentley   180026611638690    Fri9628
142       41.19   5.00  Male  ...     Eric Andrews  4356531761046453   Thur3621
156       48.17   5.00  Male  ...    Ryan Gonzales  3523151482063321    Sun7518
170       50.81  10.00  Male  ...    Gregory Clark  5473850968388236    Sat1954
182       45.35   3.50  Male  ...     Jose Parsons  4112207559459910    Sun2337
184       40.55   3.00  Male  ...      Stephen Cox  3547798222044029    Sun5140
212       48.33   9.00  Male  ...  Alex Williamson      676218815212    Sat4590

[8 rows x 11 columns]

In [94]:
options = ['Sat', 'Sun']
df[df['day'].isin(options)]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
238       35.83  4.67  Female  ...      Kimberly Crane      676184013727    Sat9777
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17

[163 rows x 11 columns]

# Apply Methods
.apply() method

In [95]:
def last_four(n):
    return str(n)[-4:]

In [96]:
df['last_four'] = df['CC Number'].apply(last_four)
df.head(5)

   total_bill   tip     sex  ...         CC Number Payment ID last_four
0       16.99  1.01  Female  ...  3560325168603410    Sun2959      3410
1       10.34  1.66    Male  ...  4478071379779230    Sun4608      9230
2       21.01  3.50    Male  ...  6011812112971322    Sun4458      1322
3       23.68  3.31    Male  ...  4676137647685994    Sun5260      5994
4       24.59  3.61  Female  ...  4832732618637221    Sun2251      7221

[5 rows x 12 columns]

In [97]:
def yelp(bill):
    if bill <= 10: 
        return '$'
    elif bill > 10 and bill < 30: 
        return '$$'
    else:
        return '$$$'

In [98]:
df['yelp'] = df['total_bill'].apply(yelp)

In [99]:
df.head(5)

   total_bill   tip     sex smoker  ...         CC Number Payment ID  last_four  yelp
0       16.99  1.01  Female     No  ...  3560325168603410    Sun2959       3410    $$
1       10.34  1.66    Male     No  ...  4478071379779230    Sun4608       9230    $$
2       21.01  3.50    Male     No  ...  6011812112971322    Sun4458       1322    $$
3       23.68  3.31    Male     No  ...  4676137647685994    Sun5260       5994    $$
4       24.59  3.61  Female     No  ...  4832732618637221    Sun2251       7221    $$

[5 rows x 13 columns]

In [100]:
df['total_bill'].apply(lambda x : x * 2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [101]:
def quality(total_bill, tip):
    if tip/total_bill > 0.25:
        return 'Generous'
    else:
        return 'Other'

In [102]:
%%time
df['Tip Quality'] = df[['total_bill', 'tip']].apply(lambda d : quality(d['total_bill'], d['tip']), axis = 1)

CPU times: user 9.6 ms, sys: 24 µs, total: 9.62 ms
Wall time: 11.2 ms

In [103]:
%%time
df['Tip Quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])

CPU times: user 1.79 ms, sys: 0 ns, total: 1.79 ms
Wall time: 2.34 ms

In [104]:
df.head(5)

   total_bill   tip     sex smoker  ... Payment ID last_four  yelp  Tip Quality
0       16.99  1.01  Female     No  ...    Sun2959      3410    $$        Other
1       10.34  1.66    Male     No  ...    Sun4608      9230    $$        Other
2       21.01  3.50    Male     No  ...    Sun4458      1322    $$        Other
3       23.68  3.31    Male     No  ...    Sun5260      5994    $$        Other
4       24.59  3.61  Female     No  ...    Sun2251      7221    $$        Other

[5 rows x 14 columns]

# Other Methods

In [105]:
df = pd.read_csv('tips.csv')

In [106]:
df.describe().transpose()

                  count          mean  ...           75%           max
total_bill        244.0  1.978594e+01  ...  2.412750e+01  5.081000e+01
tip               244.0  2.998279e+00  ...  3.562500e+00  1.000000e+01
size              244.0  2.569672e+00  ...  3.000000e+00  6.000000e+00
price_per_person  244.0  7.888197e+00  ...  9.390000e+00  2.027000e+01
CC Number         244.0  2.563496e+15  ...  4.553675e+15  6.596454e+15

[5 rows x 8 columns]

In [107]:
df.sort_values(['tip', 'size'], axis = 0, ascending = True)

     total_bill    tip     sex  ...          Payer Name         CC Number Payment ID
67         3.07   1.00  Female  ...       Tiffany Brock  4359488526995267    Sat3455
111        7.25   1.00  Female  ...         Terri Jones  3559221007826887    Sat4801
92         5.75   1.00  Female  ...        Leah Ramirez  3508911676966392    Fri3780
236       12.60   1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
0         16.99   1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
..          ...    ...     ...  ...                 ...               ...        ...
141       34.30   6.70    Male  ...      Steven Carlson  3526515703718508   Thur1025
59        48.27   6.73    Male  ...         Brian Ortiz  6596453823950595    Sat8139
23        39.42   7.58    Male  ...      Lance Peterson  3542584061609808     Sat239
212       48.33   9.00    Male  ...     Alex Williamson      676218815212    Sat4590
170       50.81  10.00    Male  ...       Gregory Clark  5473850968388236    Sat1954

[244 rows x 11 columns]

In [108]:
print(df['total_bill'].max())
print(df['total_bill'].argmax())

50.81
170

In [109]:
df.iloc[df['total_bill'].argmax()]

total_bill                     50.81
tip                               10
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Name: 170, dtype: object

In [110]:
df.corr()

                  total_bill       tip      size  price_per_person  CC Number
total_bill          1.000000  0.675734  0.598315          0.647554   0.104576
tip                 0.675734  1.000000  0.489299          0.347405   0.110857
size                0.598315  0.489299  1.000000         -0.175359  -0.030239
price_per_person    0.647554  0.347405 -0.175359          1.000000   0.135240
CC Number           0.104576  0.110857 -0.030239          0.135240   1.000000

In [111]:
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [112]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [113]:
df['sex'].replace('Female', 'F')

0         F
1      Male
2      Male
3      Male
4         F
       ...
239    Male
240       F
241    Male
242    Male
243       F
Name: sex, Length: 244, dtype: object

In [114]:
df['sex'].replace(['Female', 'Male'], ['F', 'M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [115]:
mapping_sex = {
    'Female' : 'F',
    'Male' : 'M'
}

In [116]:
df['sex'].map(mapping_sex)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [117]:
df.duplicated()       #Returns the first instance of any duplicate rows

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [118]:
simple_df = pd.DataFrame(data = [[1, 2, 3, 4], [5, 6, 7, 8], [1, 2, 3, 4]], index = ['A', 'B', 'C'], columns = [10, 11, 12, 13])

In [119]:
simple_df

   10  11  12  13
A   1   2   3   4
B   5   6   7   8
C   1   2   3   4

In [120]:
simple_df.duplicated()

A    False
B    False
C     True
dtype: bool

In [121]:
simple_df.drop_duplicates(inplace = True)

In [122]:
simple_df

   10  11  12  13
A   1   2   3   4
B   5   6   7   8

In [123]:
df[(df['total_bill'] >= 10) & (df['total_bill'] <= 20)]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
8         15.04  1.96    Male  ...     Joseph Mcdonald  3522866365840377    Sun6820
9         14.78  3.23    Male  ...       Jerome Abbott  3532124519049786    Sun3775
10        10.27  1.71    Male  ...       William Riley      566287581219    Sun2546
..          ...   ...     ...  ...                 ...               ...        ...
234       15.53  3.00    Male  ...       Tracy Douglas  4097938155941930    Sat7220
235       10.07  1.25    Male  ...       Sean Gonzalez  3534021246117605    Sat4615
236       12.60  1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[130 rows x 11 columns]

In [124]:
df[df['total_bill'].between(10, 20, inclusive = True)]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
8         15.04  1.96    Male  ...     Joseph Mcdonald  3522866365840377    Sun6820
9         14.78  3.23    Male  ...       Jerome Abbott  3532124519049786    Sun3775
10        10.27  1.71    Male  ...       William Riley      566287581219    Sun2546
..          ...   ...     ...  ...                 ...               ...        ...
234       15.53  3.00    Male  ...       Tracy Douglas  4097938155941930    Sat7220
235       10.07  1.25    Male  ...       Sean Gonzalez  3534021246117605    Sat4615
236       12.60  1.00    Male  ...       Matthew Myers  3543676378973965    Sat5032
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[130 rows x 11 columns]

In [125]:
df.nlargest(10, columns = ['tip', 'total_bill'])

     total_bill    tip     sex  ...         Payer Name         CC Number Payment ID
170       50.81  10.00    Male  ...      Gregory Clark  5473850968388236    Sat1954
212       48.33   9.00    Male  ...    Alex Williamson      676218815212    Sat4590
23        39.42   7.58    Male  ...     Lance Peterson  3542584061609808     Sat239
59        48.27   6.73    Male  ...        Brian Ortiz  6596453823950595    Sat8139
141       34.30   6.70    Male  ...     Steven Carlson  3526515703718508   Thur1025
214       28.17   6.50  Female  ...    Marissa Jackson  4922302538691962    Sat3374
183       23.17   6.50    Male  ...  Dr. Michael James     4718501859162    Sun6059
47        32.40   6.00    Male  ...       James Barnes  3552002592874186    Sun9677
239       29.03   5.92    Male  ...      Michael Avila  5296068606052842    Sat2657
88        24.71   5.85    Male  ...       Roger Taylor     4410248629955   Thur9003

[10 rows x 11 columns]

In [126]:
df.sample(frac = 0.1, random_state = 5)

     total_bill   tip  ...         CC Number Payment ID
55        19.49  3.51  ...  6502227786581768    Sun1118
191       19.81  4.19  ...  4317015327600068    Thur967
210       30.06  2.00  ...    30184049218122    Sat8361
96        27.28  4.00  ...  4563054452787961    Fri3159
163       13.81  2.00  ...  5552793481414044    Sun8594
150       14.07  2.50  ...  4813617017359506    Sun8863
240       27.18  2.00  ...  3506806155565404    Sat1766
51        10.29  2.60  ...     4999759463713    Sun4474
140       17.47  3.50  ...  5233918213804470   Thur3906
89        21.16  3.00  ...  4356005144080422   Thur6273
104       20.92  4.08  ...  4013010878990106    Sat3194
197       43.11  5.00  ...  5544902205760175   Thur9313
75        10.51  1.25  ...   213142079731108    Sat5056
98        21.01  3.00  ...  4831801127457917     Fri144
42        13.94  3.06  ...    36231182760859    Sun1699
61        13.81  2.00  ...     4766834726806    Sat3030
227       20.45  3.00  ...   213141668145910    Sat4319
130       19.08  1.50  ...   213113680829581   Thur1446
56        38.01  3.00  ...   349793629453226    Sat8903
6          8.77  2.00  ...  2223727524230344    Sun5985
123       15.95  2.00  ...  4820629318698319   Thur1992
149        7.51  2.00  ...  4823139288341889   Thur6321
174       16.82  4.00  ...  3586342145399277    Sun7621
194       16.58  4.00  ...      676210011505   Thur9318

[24 rows x 11 columns]

# Missing Data

In [127]:
df = pd.read_csv('movie_scores.csv')

In [128]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [129]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [130]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [132]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [133]:
df.dropna(thresh = 3)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [134]:
df.dropna(axis = 1, thresh = 1)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [135]:
df.dropna(subset = ['first_name', 'last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [136]:
df.fillna('NEW VALUE!')

   first_name   last_name  ... pre_movie_score post_movie_score
0         Tom       Hanks  ...               8               10
1  NEW VALUE!  NEW VALUE!  ...      NEW VALUE!       NEW VALUE!
2        Hugh     Jackman  ...      NEW VALUE!       NEW VALUE!
3       Oprah     Winfrey  ...               6                8
4        Emma       Stone  ...               7                9

[5 rows x 6 columns]

In [137]:
#df['pre_movie_score'].fillna(0, inplace = True)

In [138]:
df['pre_movie_score'].mean()

7.0

In [139]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean(), inplace = True)

In [140]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              7.0               NaN
2       Hugh   Jackman  51.0    m              7.0               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [141]:
airline_tix = {'first': 100, 'business': np.nan, 'economy-plus': 50, 'economy': 30}

In [142]:
ser = pd.Series(airline_tix)

In [143]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [144]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

# GroupBy

In [145]:
df = pd.read_csv('mpg.csv')

In [146]:
df.head(5)

    mpg  cylinders  displacement  ... model_year  origin                       name
0  18.0          8         307.0  ...         70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...         70       1          buick skylark 320
2  18.0          8         318.0  ...         70       1         plymouth satellite
3  16.0          8         304.0  ...         70       1              amc rebel sst
4  17.0          8         302.0  ...         70       1                ford torino

[5 rows x 9 columns]

In [147]:
df.groupby(by = 'model_year').mean()['mpg']

model_year
70    17.689655
71    21.250000
72    18.714286
73    17.100000
74    22.703704
75    20.266667
76    21.573529
77    23.375000
78    24.061111
79    25.093103
80    33.696552
81    30.334483
82    31.709677
Name: mpg, dtype: float64

In [148]:
df.groupby(by = ['model_year', 'cylinders']).mean()

                            mpg  displacement  ...  acceleration    origin
model_year cylinders                           ...
70         4          25.285714    107.000000  ...     16.000000  2.285714
           6          20.500000    199.000000  ...     15.500000  1.000000
           8          14.111111    367.555556  ...     11.194444  1.000000
71         4          27.461538    101.846154  ...     16.961538  1.923077
           6          18.000000    243.375000  ...     14.750000  1.000000
           8          13.428571    371.714286  ...     12.214286  1.000000
72         3          19.000000     70.000000  ...     13.500000  3.000000
           4          23.428571    111.535714  ...     17.214286  1.928571
           8          13.615385    344.846154  ...     13.000000  1.000000
73         3          18.000000     70.000000  ...     13.500000  3.000000
           4          22.727273    109.272727  ...     17.136364  2.000000
           6          19.000000    212.250000  ...     15.687500  1.250000
           8          13.200000    365.250000  ...     12.250000  1.000000
74         4          27.800000     96.533333  ...     16.400000  2.200000
           6          17.857143    230.428571  ...     16.857143  1.000000
           8          14.200000    315.200000  ...     14.700000  1.000000
75         4          25.250000    114.833333  ...     15.833333  2.166667
           6          17.583333    233.750000  ...     17.708333  1.000000
           8          15.666667    330.500000  ...     13.166667  1.000000
76         4          26.766667    106.333333  ...     16.866667  1.866667
           6          20.000000    221.400000  ...     17.000000  1.300000
           8          14.666667    324.000000  ...     13.222222  1.000000
77         3          21.500000     80.000000  ...     13.500000  3.000000
           4          29.107143    106.500000  ...     16.064286  1.857143
           6          19.500000    220.400000  ...     16.900000  1.400000
           8          16.000000    335.750000  ...     13.662500  1.000000
78         4          29.576471    112.117647  ...     16.282353  2.117647
           5          20.300000    131.000000  ...     15.900000  2.000000
           6          19.066667    213.250000  ...     16.391667  1.166667
           8          19.050000    300.833333  ...     13.266667  1.000000
79         4          31.525000    113.583333  ...     15.991667  1.583333
           5          25.400000    183.000000  ...     20.100000  2.000000
           6          22.950000    205.666667  ...     15.433333  1.000000
           8          18.630000    321.400000  ...     15.400000  1.000000
80         3          23.700000     70.000000  ...     12.500000  3.000000
           4          34.612000    111.000000  ...     17.144000  2.200000
           5          36.400000    121.000000  ...     19.900000  2.000000
           6          25.900000    196.500000  ...     15.050000  2.000000
81         4          32.814286    108.857143  ...     16.466667  2.095238
           6          23.428571    184.000000  ...     15.442857  1.714286
           8          26.600000    350.000000  ...     19.000000  1.000000
82         4          32.071429    118.571429  ...     16.703571  1.714286
           6          28.333333    225.000000  ...     16.033333  1.000000

[43 rows x 5 columns]

In [149]:
year_cyl = df.groupby(['model_year', 'cylinders']).mean()

In [150]:
print(year_cyl.index.names)
print(year_cyl.index.levels)

['model_year', 'cylinders']
[[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], [3, 4, 5, 6, 8]]

In [151]:
year_cyl.loc[[70, 82]]

                            mpg  displacement  ...  acceleration    origin
model_year cylinders                           ...
70         4          25.285714    107.000000  ...     16.000000  2.285714
           6          20.500000    199.000000  ...     15.500000  1.000000
           8          14.111111    367.555556  ...     11.194444  1.000000
82         4          32.071429    118.571429  ...     16.703571  1.714286
           6          28.333333    225.000000  ...     16.033333  1.000000

[5 rows x 5 columns]

In [152]:
year_cyl.loc[[(80, 6), (70, 4)]]

                            mpg  displacement  ...  acceleration    origin
model_year cylinders                           ...
80         6          25.900000         196.5  ...         15.05  2.000000
70         4          25.285714         107.0  ...         16.00  2.285714

[2 rows x 5 columns]

In [153]:
year_cyl.xs(key = 70, level = 0)

                 mpg  displacement       weight  acceleration    origin
cylinders
4          25.285714    107.000000  2292.571429     16.000000  2.285714
6          20.500000    199.000000  2710.500000     15.500000  1.000000
8          14.111111    367.555556  3940.055556     11.194444  1.000000

In [154]:
year_cyl.xs(key = 4, level = 1)

                  mpg  displacement       weight  acceleration    origin
model_year
70          25.285714    107.000000  2292.571429     16.000000  2.285714
71          27.461538    101.846154  2056.384615     16.961538  1.923077
72          23.428571    111.535714  2382.642857     17.214286  1.928571
73          22.727273    109.272727  2338.090909     17.136364  2.000000
74          27.800000     96.533333  2151.466667     16.400000  2.200000
75          25.250000    114.833333  2489.250000     15.833333  2.166667
76          26.766667    106.333333  2306.600000     16.866667  1.866667
77          29.107143    106.500000  2205.071429     16.064286  1.857143
78          29.576471    112.117647  2296.764706     16.282353  2.117647
79          31.525000    113.583333  2357.583333     15.991667  1.583333
80          34.612000    111.000000  2360.080000     17.144000  2.200000
81          32.814286    108.857143  2275.476190     16.466667  2.095238
82          32.071429    118.571429  2402.321429     16.703571  1.714286

In [155]:
df[df['cylinders'] > 4].groupby(['model_year', 'cylinders']).mean()

                            mpg  displacement  ...  acceleration    origin
model_year cylinders                           ...
70         6          20.500000    199.000000  ...     15.500000  1.000000
           8          14.111111    367.555556  ...     11.194444  1.000000
71         6          18.000000    243.375000  ...     14.750000  1.000000
           8          13.428571    371.714286  ...     12.214286  1.000000
72         8          13.615385    344.846154  ...     13.000000  1.000000
73         6          19.000000    212.250000  ...     15.687500  1.250000
           8          13.200000    365.250000  ...     12.250000  1.000000
74         6          17.857143    230.428571  ...     16.857143  1.000000
           8          14.200000    315.200000  ...     14.700000  1.000000
75         6          17.583333    233.750000  ...     17.708333  1.000000
           8          15.666667    330.500000  ...     13.166667  1.000000
76         6          20.000000    221.400000  ...     17.000000  1.300000
           8          14.666667    324.000000  ...     13.222222  1.000000
77         6          19.500000    220.400000  ...     16.900000  1.400000
           8          16.000000    335.750000  ...     13.662500  1.000000
78         5          20.300000    131.000000  ...     15.900000  2.000000
           6          19.066667    213.250000  ...     16.391667  1.166667
           8          19.050000    300.833333  ...     13.266667  1.000000
79         5          25.400000    183.000000  ...     20.100000  2.000000
           6          22.950000    205.666667  ...     15.433333  1.000000
           8          18.630000    321.400000  ...     15.400000  1.000000
80         5          36.400000    121.000000  ...     19.900000  2.000000
           6          25.900000    196.500000  ...     15.050000  2.000000
81         6          23.428571    184.000000  ...     15.442857  1.714286
           8          26.600000    350.000000  ...     19.000000  1.000000
82         6          28.333333    225.000000  ...     16.033333  1.000000

[26 rows x 5 columns]

In [156]:
year_cyl.swaplevel()

                            mpg  displacement  ...  acceleration    origin
cylinders model_year                           ...
4         70          25.285714    107.000000  ...     16.000000  2.285714
6         70          20.500000    199.000000  ...     15.500000  1.000000
8         70          14.111111    367.555556  ...     11.194444  1.000000
4         71          27.461538    101.846154  ...     16.961538  1.923077
6         71          18.000000    243.375000  ...     14.750000  1.000000
8         71          13.428571    371.714286  ...     12.214286  1.000000
3         72          19.000000     70.000000  ...     13.500000  3.000000
4         72          23.428571    111.535714  ...     17.214286  1.928571
8         72          13.615385    344.846154  ...     13.000000  1.000000
3         73          18.000000     70.000000  ...     13.500000  3.000000
4         73          22.727273    109.272727  ...     17.136364  2.000000
6         73          19.000000    212.250000  ...     15.687500  1.250000
8         73          13.200000    365.250000  ...     12.250000  1.000000
4         74          27.800000     96.533333  ...     16.400000  2.200000
6         74          17.857143    230.428571  ...     16.857143  1.000000
8         74          14.200000    315.200000  ...     14.700000  1.000000
4         75          25.250000    114.833333  ...     15.833333  2.166667
6         75          17.583333    233.750000  ...     17.708333  1.000000
8         75          15.666667    330.500000  ...     13.166667  1.000000
4         76          26.766667    106.333333  ...     16.866667  1.866667
6         76          20.000000    221.400000  ...     17.000000  1.300000
8         76          14.666667    324.000000  ...     13.222222  1.000000
3         77          21.500000     80.000000  ...     13.500000  3.000000
4         77          29.107143    106.500000  ...     16.064286  1.857143
6         77          19.500000    220.400000  ...     16.900000  1.400000
8         77          16.000000    335.750000  ...     13.662500  1.000000
4         78          29.576471    112.117647  ...     16.282353  2.117647
5         78          20.300000    131.000000  ...     15.900000  2.000000
6         78          19.066667    213.250000  ...     16.391667  1.166667
8         78          19.050000    300.833333  ...     13.266667  1.000000
4         79          31.525000    113.583333  ...     15.991667  1.583333
5         79          25.400000    183.000000  ...     20.100000  2.000000
6         79          22.950000    205.666667  ...     15.433333  1.000000
8         79          18.630000    321.400000  ...     15.400000  1.000000
3         80          23.700000     70.000000  ...     12.500000  3.000000
4         80          34.612000    111.000000  ...     17.144000  2.200000
5         80          36.400000    121.000000  ...     19.900000  2.000000
6         80          25.900000    196.500000  ...     15.050000  2.000000
4         81          32.814286    108.857143  ...     16.466667  2.095238
6         81          23.428571    184.000000  ...     15.442857  1.714286
8         81          26.600000    350.000000  ...     19.000000  1.000000
4         82          32.071429    118.571429  ...     16.703571  1.714286
6         82          28.333333    225.000000  ...     16.033333  1.000000

[43 rows x 5 columns]

In [157]:
year_cyl.sort_index(level = 0, ascending = False) #OR year_cyl.sort_index(level = 'model_year', ascending = False)

                            mpg  displacement  ...  acceleration    origin
model_year cylinders                           ...
82         6          28.333333    225.000000  ...     16.033333  1.000000
           4          32.071429    118.571429  ...     16.703571  1.714286
81         8          26.600000    350.000000  ...     19.000000  1.000000
           6          23.428571    184.000000  ...     15.442857  1.714286
           4          32.814286    108.857143  ...     16.466667  2.095238
80         6          25.900000    196.500000  ...     15.050000  2.000000
           5          36.400000    121.000000  ...     19.900000  2.000000
           4          34.612000    111.000000  ...     17.144000  2.200000
           3          23.700000     70.000000  ...     12.500000  3.000000
79         8          18.630000    321.400000  ...     15.400000  1.000000
           6          22.950000    205.666667  ...     15.433333  1.000000
           5          25.400000    183.000000  ...     20.100000  2.000000
           4          31.525000    113.583333  ...     15.991667  1.583333
78         8          19.050000    300.833333  ...     13.266667  1.000000
           6          19.066667    213.250000  ...     16.391667  1.166667
           5          20.300000    131.000000  ...     15.900000  2.000000
           4          29.576471    112.117647  ...     16.282353  2.117647
77         8          16.000000    335.750000  ...     13.662500  1.000000
           6          19.500000    220.400000  ...     16.900000  1.400000
           4          29.107143    106.500000  ...     16.064286  1.857143
           3          21.500000     80.000000  ...     13.500000  3.000000
76         8          14.666667    324.000000  ...     13.222222  1.000000
           6          20.000000    221.400000  ...     17.000000  1.300000
           4          26.766667    106.333333  ...     16.866667  1.866667
75         8          15.666667    330.500000  ...     13.166667  1.000000
           6          17.583333    233.750000  ...     17.708333  1.000000
           4          25.250000    114.833333  ...     15.833333  2.166667
74         8          14.200000    315.200000  ...     14.700000  1.000000
           6          17.857143    230.428571  ...     16.857143  1.000000
           4          27.800000     96.533333  ...     16.400000  2.200000
73         8          13.200000    365.250000  ...     12.250000  1.000000
           6          19.000000    212.250000  ...     15.687500  1.250000
           4          22.727273    109.272727  ...     17.136364  2.000000
           3          18.000000     70.000000  ...     13.500000  3.000000
72         8          13.615385    344.846154  ...     13.000000  1.000000
           4          23.428571    111.535714  ...     17.214286  1.928571
           3          19.000000     70.000000  ...     13.500000  3.000000
71         8          13.428571    371.714286  ...     12.214286  1.000000
           6          18.000000    243.375000  ...     14.750000  1.000000
           4          27.461538    101.846154  ...     16.961538  1.923077
70         8          14.111111    367.555556  ...     11.194444  1.000000
           6          20.500000    199.000000  ...     15.500000  1.000000
           4          25.285714    107.000000  ...     16.000000  2.285714

[43 rows x 5 columns]

In [158]:
df.agg(['mean', 'std'])

            mpg  cylinders  displacement  ...  acceleration  model_year    origin
mean  23.514573   5.454774    193.425879  ...     15.568090   76.010050  1.572864
std    7.815984   1.701004    104.269838  ...      2.757689    3.697627  0.802055

[2 rows x 7 columns]

In [159]:
 df.agg({'mpg': ['mean', 'max', 'min'], 'weight': ['max', 'min']})

            mpg  weight
max   46.600000  5140.0
mean  23.514573     NaN
min    9.000000  1613.0

# Concatenation

In [160]:
data_one = {'A' : ['A0', 'A1', 'A2', 'A3'], 'B' : ['B0', 'B1', 'B2', 'B3'] }
data_two = {'C' : ['C0', 'C1', 'C2', 'C3'], 'D' : ['D0', 'D1', 'D2', 'D3'] }

one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [161]:
pd.concat([one, two], axis = 1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [162]:
two.columns = one.columns
pd.concat([one, two], axis = 0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

# Merge

In [163]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [164]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [165]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [166]:
pd.merge(registrations, logins, how = 'inner', on = 'name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [167]:
pd.merge(registrations, logins, how = 'outer', on = 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [168]:
pd.merge(registrations, logins, how = 'left', on = 'name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [169]:
pd.merge(registrations, logins, how = 'right', on = 'name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [170]:
registrations.set_index(keys = 'name', inplace = True)

In [171]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [172]:
pd.merge(registrations, logins, left_index = True, right_on = 'name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

# Pandas

## Text Methods

In [173]:
names = pd.Series(['andrew', 'bobo', 'claire', 'david', '5'])

In [174]:
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [175]:
names.str.upper()

0    ANDREW
1      BOBO
2    CLAIRE
3     DAVID
4         5
dtype: object

In [177]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [178]:
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']

In [179]:
tickers = pd.Series(tech_finance)

In [180]:
tickers

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [181]:
tickers.str.split(',')

0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object

In [182]:
tickers.str.split(',').str[0]

0    GOOG
1     JPM
dtype: object

In [183]:
tickers.str.split(',', expand = True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [184]:
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])

In [194]:
messy_names.str.replace(';','').str.replace(' ', '', -1)

0    andrew
1      bobo
2    claire
dtype: object

In [198]:
messy_names.str.strip().str.replace(';', '', -1)

0    andrew
1      bobo
2    claire
dtype: object

In [197]:
messy_names[0]

'andrew  '

## Time and Date Methods

In [199]:
from datetime import datetime

In [200]:
year = 2017
month = 6
day = 4
hour = 6
min = 45
sec = 12

In [201]:
mydatetime = datetime(year, month, day, hour, min, sec)

In [202]:
mydatetime

datetime.datetime(2017, 6, 4, 6, 45, 12)

In [206]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])

In [211]:
timeser = pd.to_datetime(myser)

In [212]:
timeser

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [213]:
euro_date = '10-12-2006'
pd.to_datetime(euro_date, dayfirst = True)

Timestamp('2006-12-10 00:00:00')

In [214]:
pd.to_datetime(euro_date)

Timestamp('2006-10-12 00:00:00')

In [217]:
style_date = '12--Dec--2000'

In [218]:
pd.to_datetime(style_date, format = '%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [219]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [220]:
sales.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [221]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [222]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [223]:
sales.set_index('DATE', inplace = True)

In [224]:
sales.resample(rule = 'A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000